Revit 2026 API

# ConceptualConstructionType Methods

---

The ConceptualConstructionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. (Inherited from Element) |
|  | CanBeHidden | Indicates if the element can be hidden in the view.(Inherited from Element) |
|  | CanBeLocked | Identifies if the element can be locked. (Inherited from Element) |
|  | CanDeleteSubelement | Checks if given subelement can be removed from the element. (Inherited from Element) |
|  | CanHaveTypeAssigned | Identifies if the element can have a type assigned. (Inherited from Element) |
|  | ChangeTypeId(ElementId) | Changes the type of the element. (Inherited from Element) |
|  | DeleteEntity | Deletes the existing entity created by %schema% in the element (Inherited from Element) |
|  | DeleteSubelement | Removes a subelement from the element. (Inherited from Element) |
|  | DeleteSubelements | (Inherited from Element) |
|  | Dispose | (Inherited from Element) |
|  | Duplicate | Duplicates an existing element type and assigns it a new name. (Inherited from ElementType) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | EvaluateAllParameterValues | Evaluates all the parameters' values of the element. (Inherited from Element) |
|  | EvaluateParameterValues | (Inherited from Element) |
|  | GetAllConceptualConstructionsForCategory | Get all the ids of constructions applicable to the input massSubCategory |
|  | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. (Inherited from Element) |
|  | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. (Inherited from Element) |
|  | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. (Inherited from Element) |
|  | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. (Inherited from Element) |
|  | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. (Inherited from Element) |
|  | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. (Inherited from Element) |
|  | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. (Inherited from Element) |
|  | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. (Inherited from Element) |
|  | GetFloorOrSlabConstructionType | Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType. |
|  | GetGBSId | Gets the Green Building Studio identifier associated with the construction. |
|  | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. (Inherited from Element) |
|  | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. (Inherited from Element) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMaterialArea | Gets the area of the material with the given id. (Inherited from Element) |
|  | GetMaterialIds | Gets the element ids of all materials present in the element. (Inherited from Element) |
|  | GetMaterialVolume | Gets the volume of the material with the given id. (Inherited from Element) |
|  | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. (Inherited from Element) |
|  | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. (Inherited from Element) |
|  | GetOpeningConstructionType | Get an Opening ConceptualConstructionType by its ConceptualConstructionOpeningType. |
|  | GetOrderedParameters | Gets the parameters associated to the element in order. (Inherited from Element) |
|  | GetParameter | Retrieves a parameter from the element given identifier.(Inherited from Element) |
|  | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. (Inherited from Element) |
|  | GetParameters | Retrieves the parameters from the element via the given name.(Inherited from Element) |
|  | GetPhaseStatus | Gets the status of a given element in the input phase (Inherited from Element) |
|  | GetPreviewImage | Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.(Inherited from ElementType) |
|  | GetRoofConstructionType | Get a Roof ConceptualConstructionType by its ConceptualConstructionRoofType. |
|  | GetShadeConstructionType | Get a Shade ConceptualConstructionType by its ConceptualConstructionShadeType. |
|  | GetSimilarTypes | Obtains a set of types that are similar to this type. (Inherited from ElementType) |
|  | GetSubelements | Returns the collection of element subelements. (Inherited from Element) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeId | Returns the identifier of this element's type. (Inherited from Element) |
|  | GetValidTypes | Obtains a set of types that are valid for this element. (Inherited from Element) |
|  | GetWallConstructionType | Get a Wall ConceptualConstructionType by its ConceptualConstructionWallType. |
|  | GetWindowOrSkylightConstructionType | Get a Window or Skylight ConceptualConstructionType by its ConceptualConstructionWindowSkylightType. |
|  | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. (Inherited from Element) |
|  | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from Element) |
|  | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from Element) |
|  | IsExternalFileReference | Determines whether this Element represents an external file. (Inherited from Element) |
|  | IsHidden | Identifies if the element has been permanently hidden in the view.(Inherited from Element) |
|  | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. (Inherited from Element) |
|  | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. (Inherited from Element) |
|  | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. (Inherited from Element) |
|  | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. (Inherited from Element) |
|  | IsSimilarType | Checks if given type is similar to this type. (Inherited from ElementType) |
|  | IsValidConceptualConstructionId | Indicates if the ElementId is an id of a ConceptualConstructionType. |
|  | IsValidConceptualConstructionIdForCategory | Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory. |
|  | IsValidDefaultFamilyType | Identifies if this type is a valid default family type for the given family category id. (Inherited from ElementType) |
|  | IsValidSubcategoryForMassSurfaceDatas | Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData). This is the list of acceptable values: |

  1. OST_MassInteriorWall
  2. OST_MassExteriorWall
  3. OST_MassExteriorWallUnderground
  4. OST_MassRoof
  5. OST_MassFloor
  6. OST_MassSlab
  7. OST_MassShade
  8. OST_MassGlazing
  9. OST_MassSkylights
  10. OST_MassOpening

| IsValidSurfaceSubcategoryForConstruction|  Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory.
| IsValidType(ElementId)|  Checks if given type is valid for this element. (Inherited from Element)
| LookupParameter| Attempts to find a parameter on the element which has the given name.(Inherited from Element)
| RefersToExternalResourceReference|  Determines whether this Element uses external resources associated with a specified external resource type. (Inherited from Element)
| RefersToExternalResourceReferences|  Determines whether this Element uses external resources. (Inherited from Element)
| SetEntity|  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. (Inherited from Element)
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace